// Дан список некоторых целых чисел, найдите значение 20 в нем и, если оно присутствует, замените его на 200. Обновите список только при первом
// вхождении числа 20

Console.WriteLine("Hello, World!");
